/*
   Localizable.strings - Russian
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Да";
"No" = "Нет";
"Ok" = "ОК";
"Cancel" = "Отмена";
"Close" = "Закрыть";
"Save" = "Сохранить";
"Delete" = "Удалить";
"Rename" = "Переименовать";
"Extract" = "Извлечь";
"Cut" = "Вырезать";
"Paste" = "Вставить";
"Create" = "Создать";
"Reset" = "Сброс";

/* Common States */
"Loading" = "Загрузка";
"Extracting" = "Извлечение";
"Seeking" = "Поиск";
"Seeking %d%%" = "Поиск %d%%";
"Refreshing" = "Обновление";
"Browsing" = "Просмотр";
"Cancelling..." = "Отмена...";

/* Common Messages */
"Error" = "Ошибка";
"OK" = "ОК";
"Warning" = "Внимание";
"Do you want to reset to default value:\n" = "Сбросить до значения по умолчанию:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Локальные файлы";
"Browser_LocalBrowsing_SubKey" = "Просмотр, воспроизведение и удаление локальных файлов.";

"Browser_MODLAND_MainKey" = "Коллекция MODLAND";
"Browser_MODLAND_SubKey" = "%d доступных файлов.";

"Browser_HVSC_MainKey" = "Коллекция HVSC";
"Browser_HVSC_SubKey" = "%d доступных файлов.";

"Browser_Playlists_MainKey" = "Плейлисты";
"Browser_Playlists_SubKey" = "Создание, управление и прослушивание.";

"Browser_Favorites_MainKey" = "Избранное";
"Browser_Favorites_SubKey" = "Прослушивание оцененных композиций.";

"Browser_Most_played_MainKey" = "Часто слушаемое";
"Browser_Most_played_SubKey" = "Прослушивание популярных композиций.";

"Browser_Web_MainKey" = "Интернет";
"Browser_Web_SubKey" = "Просмотр веб-страниц и загрузка музыки.";

"Browser_WorldCharts_MainKey" = "Мировые чарты";
"Browser_WorldCharts_SubKey" = "Топы и ссылки для скачивания.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Музыка из видеоигр";

"Browser_UserGuide_MainKey" = "Руководство";
"Browser_UserGuide_SubKey" = "Инструкции, FAQ, советы.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Получить все отсутствующие записи";
"GetAllEntries_SubKey" = "Ограничено 256 первыми отсутствующими записями.";

"DisplayAll_MainKey" = "Список всех по имени";
"DisplayAll_SubKey" = "Текущая папка:";

"DisplayDir_MainKey" = "Список/Каталог";
"DisplayDir_SubKey" = "Все по пути:";

"DisplayAllPath_MainKey" = "Список всех по пути";
"DisplayAllPath_SubKey" = "Все по имени:";

/* Browser View Modes */
"Formats/Artists/Files" = "Форматы/Авторы/Файлы";
"Artists/Formats/Files" = "Авторы/Форматы/Файлы";
"Artists/Files" = "Авторы/Файлы";
"Formats: %d entries." = "Форматы: %d записей.";
"Artists: %d entries." = "Авторы: %d записей.";

/* Browser Stats */
"Played %d times." = "Воспроизведено %d раз.";
"Played once." = "Воспроизведено 1 раз.";
"Never played." = "Никогда не воспроизводилось.";
"%d files." = "%d файлов.";
"1 file." = "1 файл.";
"Size: %dKB" = "Размер: %dКБ";

/* Browser Messages */
"Browser not enough mem." = "Слишком много записей, недостаточно памяти.";
"Browser not enough mem. Limited." = "Слишком много записей, недостаточно памяти. Список неполный.";

/* File Operations */
"New folder" = "Новая папка";
"Enter folder name" = "Введите название папки";
"Nothing to paste" = "Нечего вставлять";
"No file to extract or not supported archive format.\n" = "Нет файла для извлечения или неподдерживаемый формат архива.\n";
"Cannot use iCloud as folder name" = "Невозможно использовать iCloud в качестве имени папки";

"Issue %d while trying to delete entry.\n%@" = "Ошибка %d при попытке удаления записи.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Ошибка %d при попытке переименования файла.\n%@";
"Issue %d while moving: %@.\n%@" = "Ошибка %d при перемещении: %@.\n%@";
"Issue %d while creating folder\n%@" = "Ошибка %d при создании папки\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "Файл недоступен локально.\nЗапуск загрузки из iCloud, проверьте в приложении 'Файлы'.";

"unavailable" = "недоступно";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Плейлист (%d)";
"Playlist/Search off" = "Плейлист/Поиск откл.";

"Local (%d, limited to %d)" = "Локальные (%d, ограничено %d)";
"Local (%d)" = "Локальные (%d)";
"Local/Search off" = "Локальные/Поиск откл.";

"Modland (%d, limited to %d)" = "Modland (%d, ограничено %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Поиск откл.";

"HVSC (%d, limited to %d)" = "HVSC (%d, ограничено %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Поиск откл.";

"ASMA (%d, limited to %d)"="ASMA (%d, ограничено %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/Поиск откл.";

/* Search Messages */
"Searching Playlists..." = "Поиск в плейлистах...";
"Searching Local files..." = "Поиск в локальных файлах...";
"Searching MODLAND..." = "Поиск в MODLAND...";
"Searching HVSC..." = "Поиск в HVSC...";

"Please enter at least 2 characters for your search." = "Введите не менее 2 символов для поиска.";
"Please activate at least 1 section for your search." = "Активируйте хотя бы 1 раздел для поиска.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "Сейчас играет";
"Now playing(%d)" = "Сейчас играет(%d)";
"Most played" = "Часто слушаемое";
"Favorites" = "Избранное";
"Resuming last\nplayed file" = "Возобновление\nпоследнего файла";

/* Player Controls */
"Previous" = "Предыдущий";
"Previous file" = "Предыдущий файл";
"Next file" = "Следующий файл";
"Next" = "Следующий";
"Shuffle" = "Перемешать";
"Voices control" = "Управление голосами";
"All voices" = "Все голоса";
"Clear 'Now Playing' queue" = "Очистить очередь воспроизведения";

/* Song Selection */
"Choose a subsong" = "Выберите подкомпозицию";
"Choose a song" = "Выберите композицию";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Ничего не воспроизводится. Выберите файл.";
"File cannot be played. Skipping to next playable file." = "Файл невозможно воспроизвести. Переход к следующему файлу.";
"Too much entries! Playlist will be limited to %d first entries." = "Слишком много записей! Плейлист будет ограничен первыми %d записями.";
"Playlist is full. Delete some entries to add more." = "Плейлист заполнен. Удалите записи, чтобы добавить новые.";

/* Metadata */
"unknown_title" = "Неизвестное название";
"unknown_album" = "Неизвестный альбом";
"now_playing_format" = "Воспроизводится: %@ из %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Новый плейлист";
"Create new playlist" = "Создать новый плейлист";
"Save current one" = "Сохранить текущий";
"Rename playlist" = "Переименовать плейлист";
"Add to a playlist" = "Добавить в плейлист";
"Choose a playlist" = "Выберите плейлист";

/* Playlist Descriptions */
"Create a new empty playlist." = "Создать новый пустой плейлист.";
"Create a playlist from currently played files." = "Создать плейлист из воспроизводимых файлов.";
"Browse files" = "Просмотр файлов";
"Add or remove entries from browser." = "Добавить или удалить записи из браузера.";
"Choose a new name." = "Выберите новое имя.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Вы уверены, что хотите удалить этот плейлист?";
"Are you sure you want to delete this entry ?" = "Вы уверены, что хотите удалить эту запись?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Загрузки";
"Download queue: 1 file" = "Очередь загрузки: 1 файл";
"Download queue: %d files" = "Очередь загрузки: %d файлов";
"No download in progress" = "Нет активных загрузок";
"Downloaded %@" = "Загружено %@";
"Downloading %@" = "Загрузка %@";
"Cannot download from this URL." = "Невозможно загрузить по этому URL.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Не удалось добавить файлы. Проверьте вручную в браузере файлов (Локальные файлы/Загрузки).";
"File already available locally. Do you want to download it again?" = "Файл уже доступен локально. Загрузить снова?";
"URL have to start with ftp:// or http://" = "URL должен начинаться с ftp:// или http://";
"Cannot connect to FTP." = "Невозможно подключиться к FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "База данных создана.";
"Database will now be recreated. Please validate & wait." = "База данных будет пересоздана. Подтвердите и подождите.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Неверная версия базы данных: %d.%d. Будет обновлена до %d.%d. Подтвердите и подождите.";
"No database found. Will create a new one. Please validate & wait..." = "База данных не найдена. Будет создана новая. Подтвердите и подождите...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Изображение обнаружено";
"Choose_SaveCover" = "Сохранить изображение как обложку для %@?";
"CoverFolder" = "Как обложку папки";
"CoverFile" = "Как обложку файла";
"Confirm_RemCurCovers" = "Удалить текущие обложки для %@ (папки и файла)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "Общие";
"Settings_Player" = "Плеер";
"Settings_Display" = "Отображение";
"Settings_Download" = "Загрузка";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Библиотеки воспроизведения";
"Settings_Settings" = "Настройки";

/* Settings Presets */
"Settings_SettingsDefault" = "По умолчанию";
"Settings_SettingsHigh" = "Высокие";
"Settings_SettingsMed" = "Средние";
"Settings_SettingsLow" = "Низкие";

"Confirm_SettingsDef" = "Вы уверены, что хотите сбросить настройки на значения 'по умолчанию'?";
"Confirm_SettingsHigh" = "Вы уверены, что хотите сбросить настройки на 'высокие' значения?";
"Confirm_SettingsMed" = "Вы уверены, что хотите сбросить настройки на 'средние' значения?";
"Confirm_SettingsLow" = "Вы уверены, что хотите сбросить настройки на 'низкие' значения?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Поиск: упрощённые регулярные выражения ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Возобновлять позицию при запуске";
"Notification" = "Уведомления";
"Notification duration" = "Длительность уведомления";
"Disable screen auto lock" = "Отключить автоблокировку экрана";
"No screen auto lock" = "Без автоблокировки экрана";
"Enable playback ratio" = "Включить коэффициент воспроизведения";
"Playback ratio" = "Коэффициент воспроизведения";
"Default length" = "Длительность по умолчанию";
"Default length %d:%.2d" = "Длительность по умолчанию %d:%.2d";
"Fade-out time" = "Время затухания";
"Silence Detection" = "Обнаружение тишины";
"Stop song if silent for more than selected number of seconds. 0: off" = "Остановить композицию при тишине дольше указанного времени. 0: откл.";
"Will skip song if nothing is played for specified duration (0=off)" = "Пропустить композицию, если ничего не воспроизводится указанное время (0=откл.)";
"Force mono" = "Принудительное моно";
"Panning" = "Панорамирование";
"Panning value" = "Значение панорамирования";
"Audio latency" = "Задержка аудио";
"Audio latency in ms" = "Задержка аудио в мс";
"Multi default action" = "Действие по умолчанию для мульти";
"Browse" = "Просмотр";
"Archive/multi play mode" = "Режим воспроизведения архива/мульти";
"Entry"="Запись";

/* Archive Settings */
"Archive multi default action" = "Действие по умолчанию для архива";
"Archive multi play mode" = "Режим воспроизведения архива";

/* Playlist Settings */
"Play/Enqueue action" = "Действие воспроизведения/постановки в очередь";
"Enqueue mode" = "Режим постановки в очередь";
"Default Action" = "Действие по умолчанию";
"Play" = "Воспроизвести";
"Enqueue" = "В очередь";
"Enq.&Play" = "В очередь и воспр.";
"First" = "Первый";
"Current" = "Текущий";
"Last" = "Последний";
"Enqueue position" = "Позиция в очереди";
"Post download action" = "Действие после загрузки";
"Nothing" = "Ничего";

/* Display Settings */
"Background mode" = "Фоновый режим";
"Partial" = "Частичный";
"Full" = "Полный";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Откл.=без фона, Частичный=продолжить музыку, Полный=приложение в фоне";
"Long name truncate" = "Обрезка длинных имён";
"Head" = "Начало";
"Mid." = "Середина";
"Tail" = "Конец";
"Filename as title" = "Имя файла как название";

/* Local Files Settings */
"Auto. restore Samples folder" = "Автовосстановление папки Samples";
"Send statistics" = "Отправлять статистику";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "База данных";
"Settings_CleanDB" = "Очистить базу данных";
"Settings_ResetPlCnt" = "Сбросить счётчики воспроизведений";
"Settings_ResetRatings" = "Сбросить оценки";
"Settings_ResetDB" = "Полностью сбросить базу данных";

"Confirm_DBClean" = "Запустить очистку базы данных (может занять время)?";
"Confirm_Reset_PlCnt" = "Вы уверены, что хотите сбросить все счётчики воспроизведений?";
"Confirm_Reset_Ratings" = "Вы уверены, что хотите сбросить все оценки?";
"Confirm_ResetDB" = "Вы уверены, что хотите полностью сбросить базу данных? Плейлисты, оценки и счётчики будут удалены.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "Локальные файлы";
"Settings_RecreateSamples" = "Пересоздать папку 'Samples'";
"Settings_FormatDownloads" = "Очистить папку 'Downloads'";
"Settings_RemCovers" = "Удалить обложки";
"Settings_UpdateFilesBackupFlag" = "Проверить файловую систему";

"Confirm_RecreateSamples" = "Вы хотите пересоздать папку 'Samples'?";
"Confirm_FormatDownloads" = "Вы хотите удалить ВСЕ файлы из папки Локальные файлы/Web?";
"Confirm_CheckFiles" = "Вы хотите выполнить проверку локальной файловой системы?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "Тип OPL";
"Stereo surround" = "Стерео окружение";

/* GBSPlay */
"HP filter type" = "Тип ВЧ фильтра";
"Highpass filter type" = "Тип высокочастотного фильтра";

/* Game Music Emu (GME) */
"Stereo separation" = "Стерео разделение";
"Ignore silence" = "Игнорировать тишину";
"Silence detection" = "Обнаружение тишины";
"Equalizer" = "Эквалайзер";
"Bass" = "Басы";
"Treble" = "Высокие";

/* GSF */
"Sound quality" = "Качество звука";
"Interpolation" = "Интерполяция";
"Low-pass filter" = "Низкочастотный фильтр";
"Echo" = "Эхо";

/* Highly Complete (HC) */
"Resample quality" = "Качество ресэмплинга";
"Main enabled" = "Основной включён";
"Reverb enabled" = "Реверберация включена";

/* NSFPlay */
"NSFPLAY default length" = "Длительность NSFPLAY по умолчанию";
"LPF strength" = "Сила НЧ фильтра";
"Min=off, default: 112" = "Мин.=откл., по умолчанию: 112";
"HPF strength" = "Сила ВЧ фильтра";
"Region" = "Регион";
"VRC7 Patches" = "Патчи VRC7";
"Force IRQ" = "Принудительный IRQ";
"Quality" = "Качество";

/* OpenMPT */
"Master volume" = "Общая громкость";
"Sampling" = "Дискретизация";
"Resampling" = "Ресэмплинг";

/* SID */
"Engine" = "Движок";
"Filter" = "Фильтр";
"Force loop" = "Принудительное повторение";
"Clock" = "Частота";
"Model" = "Модель";
"Force 2nd SID" = "Принудительный 2-й SID";
"Address 2nd" = "Адрес 2-го";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF или 0xDE00-0xDFFF";
"Force 3rd SID" = "Принудительный 3-й SID";
"Address 3rd" = "Адрес 3-го";
"Start subsong" = "Запустить субтрек";
"Subsong start position: first one or the one specified in file's header" = "Начальная позиция субтрека: первый или указанный в заголовке файла";
"Header" = "Заголовок";

/* Timidity */
"Max loop" = "Макс. повторений";
"MIDI polyphony" = "MIDI полифония";
"Amplification" = "Усиление";
"Chorus" = "Хорус";
"Reverb" = "Реверберация";
"Resample" = "Ресэмплинг";
"LP filter" = "НЧ фильтр";

/* UADE */
"Headphones" = "Наушники";
"LED filter" = "LED фильтр";
"Normalization" = "Нормализация";
"Post FX" = "Постэффекты";
"Panning" = "Панорамирование";
"Panning value" = "Значение панорамирования";
"Gain" = "Усиление";
"Gain value" = "Значение усиления";
"Force NTSC" = "Принудительный NTSC";

/* VGMPlay */
"Prefer JTAG" = "Предпочитать JTAG";
"YM2612 emulator" = "Эмулятор YM2612";
"Nuked OPN2 option" = "Опция Nuked OPN2";
"YMF262 emulator" = "Эмулятор YMF262";
"YM3812 emulator" = "Эмулятор YM3812";
"QSound emulator" = "Эмулятор QSound";
"RF5C68 emulator" = "Эмулятор RF5C68";

/* VGMStream */
"Max loop" = "Макс. повторений";

/* XMP */
"Amiga 500 Filter" = "Фильтр Amiga 500";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "Прозрачность эффектов";
"FX Fullscreen" = "Полноэкранные эффекты";
"FX FPS" = "FPS эффектов";
"FX show info" = "Показывать информацию эффектов";
"Tech Info" = "Техническая информация";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Показывать FPS и другую информацию (ЦП, разрешение, аудио данные ProjectM)";
"FX Level of details" = "Уровень детализации эффектов";
"Low" = "Низкий";
"Med" = "Средний";
"High" = "Высокий";
"Slow FX limit" = "Ограничение медленных эффектов";
"Deactivate FX if too slow." = "Отключить эффекты, если слишком медленно.";
"Weak" = "Слабый";
"Strong" = "Сильный";
"Display song info" = "Отображать информацию о композиции";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "В полноэкранном режиме показывать информацию при смене композиции. TL - верх слева, DR - низ справа, C - центр.";

/* ProjectM */
"ProjectM settings" = "Настройки ProjectM";
"ProjectM on/off" = "ProjectM вкл/откл";
"Show preset label" = "Показывать название пресета";
"Auto switch presets mode" = "Автосмена пресетов";
"Lock preset" = "Зафиксировать пресет";
"Time between preset" = "Время между пресетами";
"Blend presets" = "Смешивать пресеты";
"Blend time" = "Время смешивания";
"Bundled presets" = "Встроенные пресеты";
"Custom presets" = "Пользовательские пресеты";
"Aspect ratio" = "Соотношение сторон";
"Mesh size X" = "Размер сетки X";
"Mesh size Y" = "Размер сетки Y";
"Hard cut enabled" = "Резкая смена включена";
"Hard cut min time" = "Мин. время резкой смены";
"Hard cut sensitivity" = "Чувствительность резкой смены";
"Beat sensitivity" = "Чувствительность к биту";
"Permissive mode" = "Разрешающий режим";

/* Oscilloscope */
"Oscillo settings" = "Настройки осциллографа";
"FX mode" = "Режим эффектов";
"Show label" = "Показывать метки";
"Label font size" = "Размер шрифта меток";
"Show grid" = "Показывать сетку";
"Grid color" = "Цвет сетки";
"Line width" = "Толщина линии";
"Mono color" = "Монохромный цвет";
"Multi color set" = "Многоцветный набор";
"Reset all colors" = "Сбросить все цвета";
"Thin" = "Тонкая";
"Medium" = "Средняя";
"Thick" = "Толстая";
"Beefy" = "Очень толстая";

/* Piano Roll / MIDI */
"Piano roll" = "Пианоролл";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Активировать эффекты пианоролла, стандартные или как 'Synthesia'";
"Activate spark FX, colored or white" = "Активировать эффекты искр, цветные или белые";
"Display voices labels" = "Показывать метки голосов";
"Display octaves labels" = "Показывать метки октав";
"MIDI pattern" = "MIDI паттерн";
"MIDI cut line" = "Линия отсечения MIDI";
"MIDI bar style" = "Стиль полос MIDI";
"MIDI bar vibrato" = "Вибрато полос MIDI";
"Piano 3D" = "3D пианино";
"Piano cut line" = "Линия отсечения пианино";
"Piano color mode" = "Цветовой режим пианино";

/* Spectrum */
"3D spectrum" = "3D спектр";
"3D spectrum bloom" = "Свечение 3D спектра";
"Spectrum" = "Спектр";
"3D landscape" = "3D ландшафт";
"3D landscape bloom" = "Свечение 3D ландшафта";

/* MOD Pattern */
"MOD pattern" = "MOD паттерн";
"MOD pattern BG alpha" = "Прозрачность фона MOD паттерна";
"MOD pattern vol bar" = "Полосы громкости MOD паттерна";
"MOD pattern current line mode" = "Режим текущей строки MOD паттерна";
"MOD pattern font" = "Шрифт MOD паттерна";
"MOD pattern font size" = "Размер шрифта MOD паттерна";
"MOD pattern theme" = "Тема MOD паттерна";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Добро пожаловать в веб-браузер Modizer!</b><br><br>Используйте адресную строку выше для навигации или изучите свои закладки.<br><br>Чтобы использовать изображение в качестве обложки, скопируйте его в буфер обмена длительным нажатием (iOS) или правым кликом (macOS).";
"Bookmarks" = "Закладки";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.6 © Yohann Magnien / YoyoFR\n\nКонтакт: mailto:modizerhelp@gmail.com\nСайт: https://modizer.app\n\nЛоготип Modizer создан Steve Miele.\n\nКоличество поддерживаемых форматов/расширений файлов: 1108.\n!PM!,003,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,4V,50A,60A,61A,669,800,9TAV,A2M,A2T,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,ARP,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DSYM,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FST,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GT2,GTD,GTK,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INS,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LION,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OKTA,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OSS,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PLX,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SET,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONGPLAY,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSD,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VB2,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMF,XMS,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,YMST,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nИнтегрированные библиотеки воспроизведения:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Gbsplay\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(использует SF2 soundfont Merlin_gold)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebNEZ\n- WebSID\n- ZXTune\n\nОтказ от ответственности:\nДоступ к библиотекам Modland, HVSC и ASMA предоставляется как есть, без гарантий доступности и/или функциональности. Используйте приложение на свой риск.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "Поддержка по почте";
"Contact support by email" = "Связаться с поддержкой по email";
"[Please describe your request below]" = "[Пожалуйста, опишите ваш запрос ниже]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "Спасибо! ❤️";
"Send a tip to Modizer" = "Отправить благодарность Modizer";
"Support Modizer development" = "Поддержать разработку Modizer";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "Очистка БД и\nсброс настроек";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Первый запуск или проблема при прошлом запуске Modizer. Применить настройки по умолчанию?";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Названия намерений */
"Play" = "Воспроизвести";
"Pause" = "Пауза";
"Stop" = "Стоп";
"Next Song" = "Следующая композиция";
"Previous Song" = "Предыдущая композиция";
"Play Subsong" = "Воспроизвести подкомпозицию";
"Seek" = "Поиск";
"Set Infinite Loop" = "Установить бесконечный цикл";
"Set Loop Mode" = "Установить режим повтора";
"Set Shuffle Mode" = "Установить режим перемешивания";
"Toggle Shuffle" = "Переключить перемешивание";
"Toggle Loop Mode" = "Переключить режим повтора";
"Set Fullscreen mode" = "Установить полноэкранный режим";
"Go the player view" = "Перейти к виду плеера";
"Set FX" = "Установить FX";
"Get Now Playing" = "Получить текущее воспроизведение";
"Get Playlists" = "Получить плейлисты";
"Play some music" = "Воспроизвести музыку";
"Play most played" = "Воспроизвести часто прослушиваемые";
"Play favorites" = "Воспроизвести избранное";
"Play Playlist" = "Воспроизвести плейлист";
"Play Playlist By Name" = "Воспроизвести плейлист по имени";

/* Описания намерений */
"Starts playing music in Modizer." = "Начинает воспроизведение музыки в Modizer.";
"Pauses music playback in Modizer." = "Приостанавливает воспроизведение музыки в Modizer.";
"Stops music playback in Modizer." = "Останавливает воспроизведение музыки в Modizer.";
"Skips to the next song in Modizer." = "Переходит к следующей композиции в Modizer.";
"Skips to the previous song in Modizer." = "Переходит к предыдущей композиции в Modizer.";
"Plays a specific subsong in the current file." = "Воспроизводит определенную подкомпозицию в текущем файле.";
"Seeks to a specific position in the current song." = "Переходит к определенной позиции в текущей композиции.";
"Set the infinite loop mode in Modizer." = "Устанавливает режим бесконечного цикла в Modizer.";
"Set the loop mode in Modizer." = "Устанавливает режим повтора в Modizer.";
"Set the shuffle mode in Modizer." = "Устанавливает режим перемешивания в Modizer.";
"Toggles shuffle mode in Modizer." = "Переключает режим перемешивания в Modizer.";
"Toggles loop mode in Modizer." = "Переключает режим повтора в Modizer.";
"Set Fullscreen mode on or off in Modizer." = "Включает или выключает полноэкранный режим в Modizer.";
"Go the player view in Modizer." = "Переходит к виду плеера в Modizer.";
"Set FX mode in Modizer." = "Устанавливает режим FX в Modizer.";
"Gets information about the currently playing song." = "Получает информацию о текущей воспроизводимой композиции.";
"Gets the list of available playlists in Modizer." = "Получает список доступных плейлистов в Modizer.";
"Random picks from available local titles in Modizer." = "Случайный выбор из доступных локальных композиций в Modizer.";
"Most played titles from available local titles in Modizer." = "Наиболее воспроизводимые композиции из доступных локальных композиций в Modizer.";
"Favorites titles from available local titles in Modizer." = "Избранные композиции из доступных локальных композиций в Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Воспроизводит определенный плейлист в Modizer. Примечание: Для лучших результатов с голосовыми командами используйте 'Воспроизвести плейлист по имени'.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Воспроизводит плейлист по имени в Modizer. Рекомендуется для голосовых команд.";

/* Параметры */
"Subsong Index" = "Индекс подкомпозиции";
"The index of the subsong to play" = "Индекс подкомпозиции для воспроизведения";
"Position (seconds)" = "Позиция (секунды)";
"The position to seek to in seconds" = "Позиция для перехода в секундах";
"Relative" = "Относительная";
"Whether to seek relative to current position" = "Переходить относительно текущей позиции";
"Infinite Loop Mode" = "Режим бесконечного цикла";
"0: off, 1: infinite loop" = "0: выключен, 1: бесконечный цикл";
"Repeat Mode" = "Режим повтора";
"0: off, 1: loop current title, 2: loop playlist" = "0: выключен, 1: повторять текущую композицию, 2: повторять плейлист";
"Shuffle Mode" = "Режим перемешивания";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: выключен, 1: выбрать только одну композицию, если файл содержит подкомпозиции или является архивом, 2: воспроизвести все композиции из файла";
"Fullscreen mode" = "Полноэкранный режим";
"Activate (1) or disactivate (0) Fullscreen mode" = "Активировать (1) или деактивировать (0) полноэкранный режим";
"FX" = "FX";
"The FX to set" = "FX для установки";
"FX Mode" = "Режим FX";
"The mode to activate for the selected FX (0:off)" = "Режим для активации выбранного FX (0:выключен)";
"Playlist" = "Плейлист";
"The playlist to play" = "Плейлист для воспроизведения";
"Start Index" = "Начальный индекс";
"The index of the song to start playing from (0-based)" = "Индекс композиции для начала воспроизведения (с 0)";
"Playlist Name" = "Имя плейлиста";
"The name of the playlist to play" = "Имя плейлиста для воспроизведения";
"Which playlist would you like to play?" = "Какой плейлист вы хотите воспроизвести?";

/* Диалоговые сообщения */
"play_playlist_dialog" = "Воспроизведение плейлиста %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Плейлист не найден. Используйте 'Получить плейлисты' для просмотра доступных плейлистов.";
"No playlists found" = "Плейлисты не найдены";

/* Имена FX */
"ProjectM" = "ProjectM";
"Oscillo" = "Осциллограф";
"Piano roll" = "Нотная дорожка";
"3D Piano" = "3D пианино";
"Notes bars" = "Полосы нот";
"Tracker" = "Трекер";
"2D Spectrum" = "2D спектр";
"3D Spectrum" = "3D спектр";
"3D Landscape" = "3D ландшафт";

// ================================

"Get Now Playing" = "Получить текущее воспроизведение";
"Which playlist would you like to play?" = "Какой плейлист вы хотите воспроизвести?";


// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "Голосовые команды";
"Siri voice commands for Modizer" = "Голосовые команды Siri для Modizer";
"Voice Commands: Playback" = "Воспроизведение";
"Voice Commands: Navigation" = "Навигация";
"Voice Commands: Playlists" = "Плейлисты";
"Voice Commands: Modes" = "Режимы";
// MARK: - TABS
// ================================

"Search" = "Поиск";
"More" = "Ещё";
"Suspend" = "Приостановить";
"Clear all" = "Очистить всё";
"Online" = "Онлайн";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "О программе";
"Some general informations" = "Общая информация";
"Settings" = "Настройки";
"Global, Visu, FTP & Plugins" = "Общие, визуализация, FTP и плагины";
"Maintenance" = "Обслуживание";
"Clean DB, Reset ratings, ..." = "Очистка БД, сброс оценок, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Коллекции";
"Browse Internet" = "Просмотр интернета";
"Games Music" = "Музыка из игр";
"Mods & chiptunes" = "Моды и чиптюны";
"Other" = "Прочее";

/* Collections */
"MODLAND collection" = "Коллекция MODLAND";
"AMP collection" = "Коллекция AMP";
"HVSC collection" = "Коллекция HVSC";
"ASMA collection" = "Коллекция ASMA";
"JOSHW collection" = "Коллекция JOSHW";
"VGMRips collection" = "Коллекция VGMRips";
"SNESmusic collection" = "Коллекция SNESmusic";
"SMS Power! collection" = "Коллекция SMS Power!";
"ZXArt collection" = "Коллекция ZXArt";

/* Collection Descriptions */
"%d entries" = "%d записей";
"Thousands of entries" = "Тысячи записей";
"4K+ packs / 70K+ songs" = "4000+ паков / 70000+ композиций";
"1500+ sets / Super Nintendo/Famicom" = "1500+ наборов / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Наборы Master System и Game Gear";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Мировые чарты Modizer";
"Web browser" = "Веб-браузер";
"No internet connectivity or website down." = "Нет интернет-соединения или сайт недоступен.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "Общие";
"Default Players" = "Плееры по умолчанию";
"Visualizers" = "Визуализаторы";
"PR & NS colors settings" = "Настройки цветов PR и NS";
"Plugins" = "Плагины";

/* Player Selection */
"MOD player" = "MOD плеер";
"SAP player" = "SAP плеер";
"SID player" = "SID плеер";
"VGM player" = "VGM плеер";
"YM player" = "YM плеер";
"NSF player" = "NSF плеер";
"PT3 player" = "PT3 плеер";
"GBS player" = "GBS плеер";
"KSS player" = "KSS плеер";
"2SF player" = "2SF плеер";
"MIDI player" = "MIDI плеер";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Только для плагинов, поддерживающих эту функцию (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=авто, задержка округляется до кратного размеру аудио буфера";
"Limited: not for subsong" = "Ограничено: не для подкомпозиций";
"Default value is 3s" = "Значение по умолчанию 3с";
"Default action when selecting an archive or a multisong file" = "Действие по умолчанию при выборе архива или мультифайла";
"Play only selected entry or full archive/multisong file" = "Воспроизвести только выбранную запись или весь архив/мультифайл";
"Show Welcome screen" = "Показывать экран приветствия";
"Adplug priority for module" = "Приоритет Adplug для модуля";

/* FTP Settings */
"Server status" = "Статус сервера";
"FTP Server" = "FTP сервер";
"Authorize anonymous" = "Разрешить анонимный доступ";
"User" = "Пользователь";
"Password" = "Пароль";
"Port" = "Порт";

/* Online Settings */
"MODLAND URL" = "URL MODLAND";
"HVSC URL" = "URL HVSC";
"ASMA URL" = "URL ASMA";
"MODLAND Server" = "Сервер MODLAND";
"MODLAND cust.URL" = "Польз. URL MODLAND";
"HVSC Server" = "Сервер HVSC";
"HVSC cust.URL" = "Польз. URL HVSC";
"ASMA Server" = "Сервер ASMA";
"ASMA cust.URL" = "Польз. URL ASMA";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Прозрачность фона паттернов";
"Opacity of mod patterns view" = "Прозрачность вида mod паттернов";
"MOD Color Theme" = "Цветовая тема MOD";
"MOD Current Line" = "Текущая строка MOD";
"MOD Volume bars" = "Полосы громкости MOD";
"MOD Pattern Font" = "Шрифт паттерна MOD";
"MOD Pattern Font Size" = "Размер шрифта паттерна MOD";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "Эффекты пианоролла";
"PR/Spark FX" = "Эффекты PR/искр";
"Display voices label" = "Показывать метки голосов";
"Notes scroller FX" = "Эффекты прокрутки нот";
"NS/bars mode" = "Режим NS/полос";
"NS/bars style" = "Стиль NS/полос";
"Vibrato display" = "Отображение вибрато";
"Piano FX" = "Эффекты пианино";
"Piano bars mode" = "Режим полос пианино";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "Свечение 3D спектра";
"3D Land. Bloom" = "Свечение 3D ландшафта";
"0: off" = "0: откл.";

/* ProjectM Settings */
"ProjectM FX" = "Эффекты ProjectM";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Качество рендеринга: Max - разрешение пикселя, 1/2 - половина, ...";
"Custom presets/textures should be copied in .projectm folder" = "Пользовательские пресеты/текстуры должны быть скопированы в папку .projectm";
"Display preset name" = "Показывать название пресета";
"Lim: display and disappear quickly" = "Lim: показать и быстро скрыть";
"Auto switch presets" = "Автосмена пресетов";
"Allow loading of milk file with script issues" = "Разрешить загрузку milk файлов с проблемами скрипта";
"Default is 15s" = "По умолчанию 15с";
"Default is 2.7s" = "По умолчанию 2.7с";
"Default value is 32" = "Значение по умолчанию 32";
"Default value is 24" = "Значение по умолчанию 24";
"Default value is 20" = "Значение по умолчанию 20";
"Hardcut" = "Резкая смена";
"Hardcut triggers presets switch synchronized with beats." = "Резкая смена переключает пресеты синхронно с битом.";
"Hardcut min time" = "Мин. время резкой смены";
"Preserve aspect ratio for compatible shaders." = "Сохранять соотношение сторон для совместимых шейдеров.";
"Default value is 1" = "Значение по умолчанию 1";
"Hardcut sensitivity" = "Чувствительность резкой смены";

/* Oscilloscope Settings */
"Oscillo FX" = "Эффекты осциллографа";
"Oscillo show labels" = "Показывать метки осциллографа";
"Oscillo labels font size" = "Размер шрифта меток осциллографа";
"Oscillo show grid" = "Показывать сетку осциллографа";
"Oscillo line width" = "Толщина линии осциллографа";
"Reset all custom colors" = "Сбросить все пользовательские цвета";
"Multi color | System 1" = "Многоцветный | Система 1";
"Multi color | System 2" = "Многоцветный | Система 2";
"Multi color | System 3" = "Многоцветный | Система 3";
"Multi color | System 4" = "Многоцветный | Система 4";
"Multi color | System 5" = "Многоцветный | Система 5";
"Multi color | System 6" = "Многоцветный | Система 6";
"Multi color | System 7" = "Многоцветный | Система 7";
"Multi color | System 8" = "Многоцветный | Система 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Польз. цвет 01";
"Custom color 02" = "Польз. цвет 02";
"Custom color 03" = "Польз. цвет 03";
"Custom color 04" = "Польз. цвет 04";
"Custom color 05" = "Польз. цвет 05";
"Custom color 06" = "Польз. цвет 06";
"Custom color 07" = "Польз. цвет 07";
"Custom color 08" = "Польз. цвет 08";
"Custom color 09" = "Польз. цвет 09";
"Custom color 10" = "Польз. цвет 10";
"Custom color 11" = "Польз. цвет 11";
"Custom color 12" = "Польз. цвет 12";
"Custom color 13" = "Польз. цвет 13";
"Custom color 14" = "Польз. цвет 14";
"Custom color 15" = "Польз. цвет 15";
"Custom color 16" = "Польз. цвет 16";
"Custom color 17" = "Польз. цвет 17";
"Custom color 18" = "Польз. цвет 18";
"Custom color 19" = "Польз. цвет 19";
"Custom color 20" = "Польз. цвет 20";
"Custom color 21" = "Польз. цвет 21";
"Custom color 22" = "Польз. цвет 22";
"Custom color 23" = "Польз. цвет 23";
"Custom color 24" = "Польз. цвет 24";
"Custom color 25" = "Польз. цвет 25";
"Custom color 26" = "Польз. цвет 26";
"Custom color 27" = "Польз. цвет 27";
"Custom color 28" = "Польз. цвет 28";
"Custom color 29" = "Польз. цвет 29";
"Custom color 30" = "Польз. цвет 30";
"Custom color 31" = "Польз. цвет 31";
"Custom color 32" = "Польз. цвет 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Пропустить композицию, если ничего не воспроизводится указанное время (0=откл.)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Длительность по умолчанию";
"Oversampling. Min=0, default: 10" = "Оверсэмплинг. Мин.=0, по умолчанию: 10";
"Min=off, default: 112" = "Мин.=откл., по умолчанию: 112";
"Max=off, default: 164" = "Макс.=откл., по умолчанию: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=принудительно NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Принудительная поддержка IRQ для всех NSF, не только NSF2";
"APU unmute on reset" = "APU вкл. звук при сбросе";
"APU phase reset" = "APU сброс фазы";
"APU non linear mixing" = "APU нелинейное микширование";
"APU swap duty 1/2" = "APU обмен рабочего цикла 1/2";
"APU Initialize sweep unmute" = "APU инициализация свипа вкл. звук";
"DMC enable $4011 writes" = "DMC разрешить запись $4011";
"DMC enable periodic noise" = "DMC разрешить периодический шум";
"DMC unmute on reset" = "DMC вкл. звук при сбросе";
"DMC anti clicking" = "DMC антищелчок";
"DMC non linear mixer" = "DMC нелинейный микшер";
"DMC randomize noise on reset" = "DMC случайный шум при сбросе";
"DMC mute triangle on pitch 0" = "DMC откл. треугольник на высоте 0";
"prevents high frequency aliasing" = "предотвращает высокочастотный алиасинг";
"DMC rand. triangle" = "DMC случ. треугольник";
"randomize triangle on reset" = "случайный треугольник при сбросе";
"DMC reverse bits" = "DMC обратные биты";
"reverse bits of DPCM sample bytes" = "обратные биты байтов DPCM сэмплов";
"MMC5 non linear mixing" = "MMC5 нелинейное микширование";
"MMC5 Phase reset" = "MMC5 сброс фазы";
"Reset phase counter after write $5003 and $5007" = "Сбросить счётчик фазы после записи $5003 и $5007";
"FDS LP filter in Hz" = "FDS НЧ фильтр в Гц";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Частота среза (0Гц=откл., 2000Гц=по умолчанию)";
"FDS reset \"phase\"" = "FDS сброс \"фазы\"";
"$4085 \"resets\" modular phase" = "$4085 \"сбрасывает\" модульную фазу";
"FDS write protect" = "FDS защита записи";
"write protect $8000-DFFF" = "защита записи $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 заменить на OPLL";
"N163 Serial Multiplex mixing" = "N163 последовательное мультиплексное микширование";
"N163 Write Protect Phase" = "N163 защита записи фазы";
"N163 Limit Wavelength" = "N163 ограничение длины волны";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Только для плагина HC";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Цифровое усиление";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Значение панорамирования";
"Gain value" = "Значение усиления";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Отключить";
"Enter playlist name" = "Введите название плейлиста";
"Ask" = "Спросить";
"Play All" = "Воспроизвести всё";
"Single" = "Одиночный";
"Archive" = "Архив";
"On" = "Вкл.";
"Off" = "Откл.";
"Lim" = "Огр.";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Добавить плейлист";
"Create a new playlist" = "Создать новый плейлист";
"Now playing" = "Сейчас играет";
"1 entry" = "1 запись";
"No entry" = "Нет записей";
"Random picks" = "Случайный выбор";
"Generate a randomized playlist" = "Создать случайный плейлист";
"Most played" = "Часто слушаемое";
"Favorites" = "Избранное";

/* Playlist Actions */
"Add/Remove files..." = "Добавить/удалить файлы...";
"More actions..." = "Больше действий...";
"Save as a new playlist" = "Сохранить как новый плейлист";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "Добро пожаловать в Modizer!\n";
"Level up your library." = "Прокачайте свою библиотеку.";
"Sound meets visuals." = "Звук встречается с визуализацией.";
"Made with passion,\noffered for free." = "Создано с любовью,\nпредлагается бесплатно.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Ваш путь к ретро и трекерной музыке.\nЗапустите на своём устройстве легендарные игровые мелодии, культовые трекерные модули и классические чиптюны.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Просматривайте и воспроизводите из онлайн-каталогов, пополняя свои коллекции.\nСоздавайте, редактируйте и слушайте плейлисты без усилий.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Откройте классический вид осциллографа, спектральные полосы, пианоролл, вид трекера и эффекты ProjectM/Milkdrop. Позвольте Modizer раскрасить каждый трек движением и цветом.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Если вам нравится приложение, благодарности - отличный способ поддержать его разработку.\nСпасибо за помощь в развитии Modizer.";

"Skip" = "Пропустить";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Поддержать благодарностью";
"Enjoy Modizer ?" = "Нравится Modizer?";
"Your support helps keep Modizer running and ad-free!" = "Ваша поддержка помогает развивать Modizer и сохранять его без рекламы!";
"Already tipped so far" = "Уже отправлено благодарностей";
"Thank you for your support! ❤️" = "Спасибо за вашу поддержку! ❤️";

/* Tip Tiers */
"Coffee" = "Кофе";
"Coffee & Croissant" = "Кофе и круассан";
"Dinner" = "Ужин";
"Loading..." = "Загрузка...";

/* Tip Actions */
"Confirm Tip" = "Подтвердить благодарность";
"Send Tip" = "Отправить благодарность";
"Send a %@ tip for %@?" = "Отправить благодарность %@ за %@?";
"Tip" = "Благодарность";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Невозможно загрузить товары. Проверьте интернет-соединение.";

/* Thank You Alert */
"Thank You! ❤️" = "Спасибо! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "Ваша поддержка значит всё! Спасибо за помощь в развитии Modizer.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Очистить базу данных";
"Clear 'Now Playing' queue" = "Очистить очередь воспроизведения";
"Recreate Samples folder" = "Пересоздать папку Samples";
"Reset settings to default" = "Сбросить настройки по умолчанию";
"Remove current cover" = "Удалить текущую обложку";
"Reset Ratings" = "Сбросить оценки";
"Reset Played Counters" = "Сбросить счётчики воспроизведений";
"Reset Database" = "Сбросить базу данных";
"Clear images cache" = "Очистить кэш изображений";

/* Playlists missing files download */
"Download missing playlists files" = "Скачать недостающие файлы плейлистов";
"Queue the download of the missing files coming from online collections ?" = "Поставить в очередь загрузку недостающих файлов из онлайн-коллекций?";
"Download missing files" = "Скачать недостающие файлы";
"%d missing file(s)" = "Недостающих файлов: %d";
"%d missing file(s), %d can be downloaded. Tap to download." = "Недостающих файлов: %d, доступно для загрузки: %d. Нажмите, чтобы скачать.";
"Supported collections:" = "Поддерживаемые коллекции:";
"Check" = "Проверить";
"Checking playlists" = "Проверка плейлистов";
"Download manager is not available." = "Менеджер загрузок недоступен.";
"%d file(s) queued for download." = "Файлов в очереди на загрузку: %d.";
"%d file(s) already available." = "Файлов уже доступно: %d.";
"%d file(s) not from an online collection." = "Файлов не из онлайн-коллекции: %d.";
"%d file(s) cannot be resolved (%@), browse the collection to download them." = "Не удалось определить источник %d файла(ов) (%@), откройте коллекцию, чтобы скачать их.";

/* Maintenance Messages */
"Settings reseted" = "Настройки сброшены";
"Ratings reseted" = "Оценки сброшены";
"Played Counters reseted" = "Счётчики воспроизведений сброшены";
"Samples folder created" = "Папка Samples создана";
"Cache cleaned" = "Кэш очищен";
"Database reseted" = "База данных сброшена";
"No cover to remove" = "Нет обложки для удаления";
"Cover removed" = "Обложка удалена";
"Database cleaned" = "База данных очищена";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Вы уверены, что хотите очистить БД? Это может занять время.";
"Clean" = "Очистить";
"Cleaning DB" = "Очистка БД";
"Cancelling..." = "Отмена...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "Закрыть окно\nэффектов";
"All FX off" = "Все эффекты откл.";
"FX\nalpha" = "Прозрачность\nэффектов";
"Show name\ntemp." = "Показ имени\nвременно";
"Show name" = "Показ имени";
"Bundled\npresets" = "Встроенные\nпресеты";
"Custom\npresets" = "Польз.\nпресеты";
"Blend\npresets" = "Смешивание\nпресетов";
"Clear\nall" = "Очистить\nвсё";
"Select\nall" = "Выбрать\nвсё";
"Favorites" = "Избранное";
"Expand" = "Развернуть";
"Select\nlisted" = "Выбрать\nперечисленное";
"Remove\nlisted" = "Удалить\nперечисленное";
"Selected" = "Выбрано";
"Collapse" = "Свернуть";
"Labels" = "Метки";
"Grid" = "Сетка";
"Voices\nlabels" = "Метки\nголосов";
"Octaves\nlabels" = "Метки\nоктав";
"Volume\nbars" = "Полосы\nгромкости";
"Fixed bar" = "Фикс. полоса";
"BG\nopacity" = "Прозрачность\nфона";
"Bloom:\n%s" = "Свечение:\n%s";
"Thickness:\n%s" = "Толщина:\n%s";
"Font size\n%s" = "Размер шрифта\n%s";
"Font:\n%s" = "Шрифт:\n%s";
"Info HUD:\n%s" = "Инфо HUD:\n%s";
"Select active %s presets" = "Выбрать активные %s пресеты";
"bundled" = "встроенные";
"custom" = "польз.";
"Select\ncustom\npresets" = "Выбрать\nпольз.\nпресеты";
"Select\nbundled\npresets" = "Выбрать\nвстроенные\nпресеты";
"Themes:\n%s" = "Темы:\n%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "Воспроизвести музыку в Modizer";
"Start random playlist in Modizer" = "Запустить случайный плейлист в Modizer";
"Play favorites in Modizer" = "Воспроизвести избранное в Modizer";
"Start favorites playlist in Modizer" = "Запустить плейлист избранного в Modizer";
"Play most played in Modizer" = "Воспроизвести самые популярные в Modizer";
"Start most played playlist in Modizer" = "Запустить плейлист самых популярных в Modizer";
"Play a playlist in Modizer" = "Воспроизвести плейлист в Modizer";
"Start a playlist in Modizer" = "Запустить плейлист в Modizer";
"Toggle shuffle mode in Modizer" = "Переключить случайный режим в Modizer";
"Change shuffle mode in Modizer" = "Изменить режим перемешивания в Modizer";
"Change loop mode in Modizer" = "Изменить режим повтора в Modizer";
"Toggle repeat in Modizer" = "Переключить повтор в Modizer";
"What's playing in Modizer" = "Что играет в Modizer";
"Current song in Modizer" = "Текущая песня в Modizer";

"Voices commands aren't supported in MacOS." = "Голосовые команды не поддерживаются в macOS.";

/* Error messages */
"playlist_not_found_error" = "Плейлист не найден. Используйте 'Получить плейлисты', чтобы увидеть доступные плейлисты.";
"playlist_empty_error" = "Этот плейлист пуст. Пожалуйста, сначала добавьте музыку.";

"%@ (name)" = "%@ (название)";
  "%@ (packs)" = "%@ (пакеты)";
  "%@ (rating)" = "%@ (рейтинг)";
  "2D Spectrum settings" = "Настройки 2D-спектра";
  "3D landscape settings" = "Настройки 3D-ландшафта";
  "3D spectrum settings" = "Настройки 3D-спектра";
  "Auto\nscaling" = "Авто\nмасштаб";
  "CGSC collection" = "Коллекция CGSC";
  "CoverLibraryFolder" = "Как обложка текущей папки библиотеки";
  "Feeling lucky" = "Мне повезёт";
  "Hide MIDI & Piano FX" = "Скрыть FX MIDI и Piano";
  "Hide other note based FX if displayed (Piano, Midi)" = "Скрыть другие FX на основе нот, если отображаются (Piano, Midi)";
  "JoshW Covers" = "Обложки JoshW";
  "Limit applied in Radio mode to avoid downloading too big files." = "Лимит применяется в режиме радио, чтобы избежать загрузки слишком больших файлов.";
  "MIDI pattern settings" = "Настройки MIDI-паттерна";
  "MOD Pattern settings" = "Настройки MOD-паттерна";
  "Next: %@" = "Далее: %@";
  "Next: loading..." = "Далее: загрузка...";
  "Piano 3D settings" = "Настройки 3D-пианино";
  "Piano roll settings" = "Настройки Piano roll";
  "Radio download limit" = "Лимит загрузки радио";
  "Radio mode" = "Режим радио";
  "Try to download covers from TGDB or MobyGames." = "Попытаться загрузить обложки с TGDB или MobyGames.";  

/* Cloud */
  "Add Cloud Source" = "Добавить облачный источник";
  "Browse iCloud, Dropbox, ..." = "Обзор iCloud, Dropbox, ...";
  "Name this source" = "Назовите этот источник";
  "Enter a name for this cloud folder" = "Введите имя для этой облачной папки";
  "Cloud Folder" = "Облачная папка";
  "Add" = "Добавить";
  "This cloud folder was added but may not persist after the app is closed. Some cloud providers don't support persistent access." = "Эта облачная папка была
  добавлена, но может не сохраниться после закрытия приложения. Некоторые облачные провайдеры не поддерживают постоянный доступ.";
  "File cannot be downloaded.\nPlease check your internet connection." = "Файл не может быть загружен.\nПожалуйста, проверьте подключение к интернету.";
  "Downloading from\ncloud..." = "Загрузка из\nоблака...";
  "Download timed out. Please try again later." = "Время загрузки истекло. Пожалуйста, попробуйте позже.";
  "available" = "доступно";

"Copy" = "Копировать";
"Database couldn't be updated." = "Не удалось обновить базу данных.";
"Database updated." = "База данных обновлена.";
"Issue %d while copying: %@.\n%@" = "Ошибка %d при копировании: %@.\n%@";
"Old database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Старая версия базы данных: %d.%d. Будет обновлена до %d.%d. Подтвердите и
подождите.";
"Use STIL data" = "Использовать данные STIL";
"Used for subsongs titles and related artists names." = "Используется для названий подпесен и имён связанных исполнителей.";

